app/Controllers/Casos.php

    public function caso(): string
    {
        $casosModel = new CasosModel();
        $data = array("todos" => $casosModel->findAll());
---
SELECT *
FROM `casos`