app/Controllers/Cliente.php

SELECT *
FROM `clientes`
---
    public function clin(): string
    {
        $clienteModel = new ClienteModel();
        $data = array("todos" => $clienteModel->findAll());

INSERT INTO `clientes` (`nombre`, `apellido`, `dui`, `telefono`, `direccion`, `correo`) VALUES ('María Fernanda', 'Gómez Hernández', '87654321-0', '7111-2222', 'San Miguel, El Salvador', 'maria@gmail.com')
---
        public function guardar()
    {
        $abogadoModel = new ClienteModel();
        $data = array(
            'nombre' => $this->request->getPost('nombres'),
            'apellido' => $this->request->getPost('apellidos'),
            'dui' => $this->request->getPost('dui'),
            'telefono' => $this->request->getPost('telefono'),
            'direccion' => $this->request->getPost('direccion'),
            'correo' => $this->request->getPost('correo'),
        );
        $abogadoModel->insert($data);