app/Controllers/Home.php

    public function index(): string
    {
        $alumnoModel = new AbogadoModel();
        $data = array("todos" => $alumnoModel->findAll());
---
SELECT *
FROM `abogados`

     public function perfil()
    {
        $abogadoModel = new \App\Models\AbogadoModel();
        $data['todos'] = $abogadoModel->findAll();
---
SELECT *
FROM `abogados`